# -*- coding: utf-8 -*-
"""Домашнее задание №1. NumPy

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/12_XhLpxPfowUQIhFIuGuPoLkfDTLNmZa
"""

"""Задание 1
Создайте numpy array с элементами от числа N до 0 (например, для N = 10 это будет array([9, 8, 7, 6, 5, 4, 3, 2, 1, 0]))."""

import numpy as np
N = int(input('Введите начальное число: '))
x = np.array([1,2,3])
np.arange(N-1,-1,-1)

"""Задание 2
Создайте диагональную матрицу с элементами от N до 0. Посчитайте сумму ее значений на диагонали."""
N1 = int(input('Введите начальное число (входит в матрицу): '))
di = np.diag(np.arange(N1,-1,-1))
print(di)
diag_sum = 0
for i in range(N1+1):
  diag_sum += i
print(diag_sum)

"""Задание 3
Решите систему уравнений:"""
print('Дано:\n4x + 2y + z = 4\nx + 3y = 12\n5y + 4z = -3\n')
from numpy import linalg
a_mat = np.array([[4, 2, 1], [1, 3, 0], [0, 5, 4]])
b_mat = np.array([4,12,-3])
print (f'Ответ:\nx = {round(linalg.solve(a_mat, b_mat)[0], 3)}\ny = {round(linalg.solve(a_mat, b_mat)[1], 3)}\nz = {round(linalg.solve(a_mat, b_mat)[2], 3)}')

"""Задание 4
Задание и входные данные к нему находятся в материалах занятия (ноутбук Python_9_Numpy.ipynb, раздел “Задача 4 домашнего задания”)"""
"""
Имеется матрица покупок в интернет-магазине. Столбец А - ID пользователя. Остальные столбцы - количество покупок категорий товаров этим пользователем:
users_stats = np.array(
    [
        [2, 1, 0, 0, 0, 0],
        [1, 1, 2, 1, 0, 0],
        [2, 0, 1, 0, 0, 0],
        [1, 1, 2, 1, 0, 1],
        [0, 0, 1, 2, 0, 0],
        [0, 0, 0, 0, 0, 5],
        [1, 0, 0, 0, 0, 0],
        [0, 1, 1, 0, 0, 0],
        [0, 0, 0, 1, 1, 3],
        [1, 0, 0, 2, 1, 4]
    ], 
    np.int32
)
На сайт заходит очередной посетитель, о покупках которого известно следующее:
next_user_stats = np.array([0, 1, 2, 0, 0, 0])
Найдите самого похожего пользователя. Т. е. посчитайте косинусное сходство между этим пользователем и всеми пользователями из массива user_stats"""

users_stats = np.array(
    [
        [2, 1, 0, 0, 0, 0],
        [1, 1, 2, 1, 0, 0],
        [2, 0, 1, 0, 0, 0],
        [1, 1, 2, 1, 0, 1],
        [0, 0, 1, 2, 0, 0],
        [0, 0, 0, 0, 0, 5],
        [1, 0, 0, 0, 0, 0],
        [0, 1, 1, 0, 0, 0],
        [0, 0, 0, 1, 1, 3],
        [1, 0, 0, 2, 1, 4]
    ], 
    np.int32
)

def cosine( a, b ):
    """
    Подсчет косинуса угла между векторами a, b по их координатам
    """
    return np.dot( a, b ) / ( aLength * bLength )

next_user_stats = np.array([0, 1, 2, 0, 0, 0])
#print(next_user_stats)
a = next_user_stats

top = {}

aLength = np.sqrt( (a*a).sum() )

user_id = 0
for i in users_stats:
  user_id += 1
  #print(user_id)
  b = i
  bLength = np.sqrt( (b*b).sum() )
  #print(cosine( a, b ))
  top[round(cosine(a,b),3)]=user_id

number_user = 0
top = sorted(top.items(), reverse = True)
print('ТОП 3 ПОДХОДЯЩИХ ПОЛЬЗОВАТЕЛЕЙ:')
for i in top:
  number_user += 1 
  print(f'\nПользователь №{i[1]}. Сходство: {round(i[0]*100, 3)}%')
  if number_user == 3:
    break