# -*- coding: utf-8 -*-
"""Домашнее задание №1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1SA6sUzxrghi_3mtm1-7G63YPgM9MQDji
"""

#Задание №1
#Даны 2 переменных, в которых хранятся строки произвольной длины: phrase_1 и phrase_2. Напишите код, который проверяет какая из этих строк длиннее.

phrase_1 = input()
phrase_2 = input()
if len(phrase_1) > len(phrase_2):
  print ('Фраза 1 длиннее фразы 2')
elif len(phrase_2) > len(phrase_1):
  print ('Фраза 2 длиннее фразы 1')
else: 
  print ('Фразы равной длины')

#Задание №2
"""
Дана переменная, в которой хранится число (год). Необходимо написать программу, которая выведет, является ли данный год високосным или обычным.
В соответствии с григорианским календарем, год является високосным, если его номер кратен 4, но не кратен 100, а также если он кратен 400.
"""
year = int(input())
if (year % 100 != 0 and year % 4 == 0) or (year % 400 == 0):
    print ('Високосный год')
else:
    print ('Обычный год')

#Задание №3
#Необходимо написать программу, которая будет запрашивать у пользователя месяц и дату рождения и выводить соответствующий знак зодиака.

month = int(input('Введите месяц рождения числом от 1 до 12: '))
day = int(input('Введите день рождения: '))
if month == 1:
  if day < 21:
    z = 'Козерог'
  else:
    z = 'Водолей'
elif month == 2:
  if day < 20:
    z = 'Водолей'
  else:
    z = 'Рыбы'
elif month == 3:
  if day < 21:
    z = 'Рыбы'
  else:
    z = 'Овен'
elif month == 4:
  if day < 21:
    z = 'Овен'
  else:
    z = 'Телец'
elif month == 5:
  if day < 22:
    z = 'Телец'
  else:
    z = 'Близнецы'
elif month == 6:
  if day < 22:
    z = 'Близнецы'
  else:
    z = 'Рак'
elif month == 7:
  if day < 23:
    z = 'Рак'
  else:
    z = 'Лев'
elif month == 8:
  if day < 22:
    z = 'Лев'
  else:
    z = 'Дева'
elif month == 9:
  if day < 24:
    z = 'Дева'
  else:
    z = 'Весы'
elif month == 10:
  if day < 24:
    z = 'Весы'
  else:
    z = 'Скорпион'
elif month == 11:
  if day < 23:
    z = 'Скорпион'
  else:
    z = 'Стрелец'
elif month == 12 and day < 23:
    z = 'Стрелец'
else:
    z = 'Козерог'
print ('Ваш знак зодиака - ',z)

#Задание №4
""" 
Вам нужно написать программу для подбора упаковок по размерам товара. Размеры (ширина, длина, высота) хранятся в переменных (в сантиметрах)
Используйте следующие правила:
    если каждое из трех измерений менее или равно 15 сантиметрам, то выведите на экран "Коробка №1";
    если хотя бы одно из измерений больше 15 сантиметров, но менее 50 сантиметров, то выводите "Коробка №2";
    если длина товара больше 2 метров, то выводите "Упаковка для лыж";
    во всех остальных случаях выводите "Стандартная коробка №3".
"""

length = int(input())
width = int(input())
height = int(input())
if length > 200:
  print('Упаковка для лыж')
elif length <=15 and width <=15 and height <=15:
  print('Коробка №1')
elif length >=50 or width >=50 or height >=50:
  print('Стандартная коробка №3')
else:
  print('Коробка №2')

#Задание 5
"""
Дана переменная, в которой хранится шестизначное число (номер проездного билета). 
Напишите программу, которая будет определять, является ли данный билет "счастливым". 
Билет считается счастливым, если сумма первых трех цифр совпадает с суммой последних трех цифр номера.
"""
number = int (input('Введите число от 0 до 999999: '))
if number < 0 or number > 999999:
  print ('Введите число от 0 до 999999!')
  number = int (input('Введите число от 0 до 999999: '))
first_part = number // 100000 + number%100000//10000 + number%10000//1000
second_part = number % 1000//100 + number%100//10 + number%10
if first_part == second_part:
  print ('Поздравляю! Это счастливый билет')
else:
  print ('Увы, это несчастливый билет. Повезёт в другой раз! :)')

#Задание 6
"""
Напишите программу, которая сможет вычислять площади трех фигур (круг, треугольник и прямоугольник). Тип фигуры запрашиваем через пользовательский ввод, после чего делаем запрос характеристик фигуры:
    если пользователь выбрал круг, запрашиваем его радиус,
    если треугольник – длины трех его сторон;
    если прямоугольник – длины двух его сторон.
"""

from math import * 

figure_type = int(input('Выберите номер фигуры: 1 - круг, 2 - треугольник, 3 - прямоугольник: '))
if figure_type == 1:
  radius = float(input('Введите радиус круга: '))
  s = pi*radius**2
  print('Площадь круга равна', s, 'ед.')
elif figure_type == 2:
  a = float(input('Введите сторону A: '))
  b = float(input('Введите сторону B: '))
  c = float(input('Введите сторону C: '))
  p = (a + b + c)/2 
  s = sqrt(p*(p-a)*(p-b)*(p-c))
  print('Площадь треугольника равна', s, 'ед.')
else:
  a = float(input('Введите сторону A: '))
  b = float(input('Введите сторону B: '))
  s = a * b
  print('Площадь прямоугольника равна', s, 'ед.')