# -*- coding: utf-8 -*-
"""Домашнее задание №5.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/16bjRcPg5qhCL0ribe5am2xnQ57aGq3QL
"""

#Задание 1
"""
Переведите содержимое файла purchase_log.txt в словарь purchases вида:
{‘1840e0b9d4’: ‘Продукты’, …}
"""

f = open('purchase_log.txt', 'r')
import json
purchases_list = []
new_list = f.readlines()
f.seek(0)
f.close()
purchases = {}
for line in new_list:
  line = line.strip()
  dictionary = json.loads(line)
  if dictionary['user_id'] in purchases:
    purchases_list.append(str((dictionary['user_id'])))
  purchases[dictionary['user_id']] = dictionary['category']

#количество элементов в текстовом файле 100000
#print(len(new_list), '\n')

#количество уникальных идентификаторов пользователя 99518
#print(len(purchases), '\n')

#количество повторяющихся идентификаторов пользователя два и более раз 482
#print(len(purchases_list), '\n')

#количество повторяющихся идентификаторов пользователя не более двух раз 481
#print(len(set(purchases_list)), '\n')

x = 0
for k, v in purchases.items():
  x += 1
  print(k,v)
  if x > 5:
    break

#purchases

#Задание 2
"""
Для каждого user_id в файле visit_log.csv определите третий столбец с категорией покупки 
(если покупка была, сам файл visit_log.csv изменять не надо). 
Запишите в файл funnel.csv визиты из файла visit_log.csv, в которых были покупки с указанием категории. 
Учтите условия на данные: 
содержимое purchase_log.txt помещается в оперативную память компьютера 
содержимое visit_log.csv - нет; используйте только построчную обработку этого файла"""

#Вариант №1
tx = open('visit_log.csv', 'r')
#определяем список, в который будем вставлять данные о покупках, предварительно вносим названия столбцов
new_visit_list = ['user_id, source, category\n']
id_num = 0
funn = open('funnel.csv', 'w')
#получаем данные идентификаторов из логов визитов
for every_string in tx:
  #читаем одну строку и заносим её в переменную b, очищаем от ненужных элементов
  b = tx.readline().strip().split(',')
  #заносим данные в столбцы
  row_id = b[0]
  row_source = b[1]
  id_num += 1
  #проверяем, есть ли данный идентификатор в словаре с покупками, и добавляем в new_visit_list с категорией из словаря
  if row_id in purchases.keys():
    new_visit_list.append(row_id + ',' + row_source + ',' + purchases[row_id] + '\n')
#записываем в funnel.csv только уникальные строки
for i in range(len(set(new_visit_list))):
  funn.write(new_visit_list[i])
funn.close()
funn = open('funnel.csv', 'r')
funn.readline()
#funn.close()

#Вариант №2
tx = open('visit_log.csv', 'r')
id_num = 0
funn = open('funnel.csv', 'w')
funn.write('user_id, source, category\n')
#получаем данные идентификаторов из логов визитов
for every_string in tx:
  #читаем одну строку и заносим её в переменную b, очищаем от ненужных элементов
  b = tx.readline().strip().split(',')
  #заносим данные в столбцы
  row_id = b[0]
  row_source = b[1]
  id_num += 1
  #проверяем, есть ли данный идентификатор в словаре с покупками, и добавляем категорию из словаря
  if row_id in purchases.keys():
    new_w = (row_id + ',' + row_source + ',' + purchases[row_id] + '\n')
    funn.write(new_w)
funn.close()
#funn = open('funnel.csv', 'r')
#funn.readline()
#funn.close()