# -*- coding: utf-8 -*-
"""Домашнее задание №2.ipynb"

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1ky9T-od00YtPKv91JYDcbTIhLCcAjiP6
"""

#Домашнее задание к лекции "Введение в типы данных и циклы. Часть 1"
#Задание 1
""" 
Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:
среднюю букву, если число букв в слове нечетное;
две средних буквы, если число букв четное.
"""

word = input()
word_length = len(word)
if word_length % 2 == 0:
 letter1 = int(word_length / 2 - 1)
 letter2 = letter1 + 1
 print(word[letter1] + word[letter2])
else:
 letter1 = int((word_length - 1) / 2)
 print(word[letter1])

#Задание 2
"""
Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел.
"""

number = int(input('Введите число: '))
sum_of_numbers = 0
while number != 0:
  sum_of_numbers += number
  number = int(input('Введите ещё одно число: '))
print(f'Программа окончена. Сумма чисел равна: {sum_of_numbers}')

#Задание 3
"""
Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.
Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки!
Но мы не будем никого знакомить, если кто-то может остаться без пары.
"""
boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']
girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']
answer = input('Хотите добавить анкету участника? Y/N: ')
while answer.lower() == 'y':
  if answer.lower() == 'y':
    answer = input('Выберите пол M/W: ')
    if answer.lower() == 'm':
      boys.append(input('Введите имя: ').capitalize())
      print(boys)
      answer = input('Хотите добавить анкету участника? Y/N: ')
    else:
      girls.append(input('Введите имя: ').capitalize())
      print(girls)
      answer = input('Хотите добавить анкету участника? Y/N: ')
if len(boys) > len(girls):
  print('Нам не хватает девушек!')
elif len(boys) < len(girls):
  print('У нас не разрешено многожёнство, надо найти ещё мужчин!')
else:
  date_list = list(zip(sorted(boys), sorted(girls)))
  print('Идеальные пары:')
  for paar in date_list:
    print(f'{paar[0]} и {paar[1]}')

#Задание 4
"""
У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах за произвольный период по странам (структура данных в примере). 
Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях(!) для каждой страны.
"""

countries_temperature = [
    ['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],
    ['Germany', [57.2, 55.4, 59, 59, 53.6]],
    ['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],
    ['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]
]
print('Средняя температура в странах:')
for country in countries_temperature:
  print(country[0],'-', round((sum(country[1])/len(country[1])-32)*5/9, 1),'°C')

#Задание 5 (необязательное)
"""
Дан поток логов по количеству просмотренных страниц для каждого пользователя. 
Вам необходимо написать алгоритм, который считает среднее значение просмотров на пользователя. 
Т. е. надо посчитать отношение суммы всех просмотров к количеству уникальных пользователей.
"""
#stream = [] 
#при наполнении пустого списка снять решётку
answer = input('Хотите добавить значения? Y/N: ')
while answer.lower() == 'y':
  if answer.lower() == 'y':
    answer = input('Введите значения в формате дата,пользователь,кол-во просмотров "2018-01-01,user1,3": ')
    stream.append(answer)
    print(stream)
    answer = input('Хотите добавить значения? Y/N: ')
stream = [
    '2018-01-01,user1,3',
    '2018-01-07,user1,4',
    '2018-03-29,user1,1',
    '2018-04-04,user1,13',
    '2018-01-05,user2,7',
    '2018-06-14,user3,4',
    '2018-07-02,user3,10',
    '2018-03-21,user4,19',
    '2018-03-22,user4,4',
    '2018-04-22,user4,8',
    '2018-05-03,user4,9',
    '2018-05-11,user4,11',
] 
#можно использовать при проверке
#print(','.join(stream))
stream = ','.join(stream)
stream = stream.split(',')
#print(stream)
unique = []
sum_of_view = 0
for i in range(len(stream)):
  if i%3==0:
    sum_of_view += int(stream[i+2])
    if stream[i+1] not in unique:
      unique.append(stream[i+1])
print(f'Количество уникальных пользователей: {len(unique)}')
print(f'Сумма всех просмотров: {sum_of_view}')
print(f'Среднее число просмотров на пользователя: {sum_of_view/len(unique)}')

#UPD: просмотрев вторую часть по управляющим конструкциям, понял, что код можно было укоротить в разы :D ... Но пусть уже будет так

#Задание 6 (необязательное)
"""
Необходимо у пользователя запрашивать набор чисел разделенных пробелом. 
В результате в отсортированном порядке должны выводиться числа, которые повторяются в вводе более одного раза.
"""

numbers = input('Введите числа через пробел: ')
numbers = numbers.split(' ')
result = []
result2 = []
for i in numbers:
  if i not in result:
      result.append(i)
  else:
      result2.append(i)
result3 = []
for i in result2:
  if i not in result3:
    result3.append(i)
result3 = sorted(result3)
print('Повторяющиеся числа:', ' '.join(result3))